Revit 2027 API
PrintManager Methods
The PrintManager type exposes the following members.
Methods
Name | Description
Apply |  Apply the local print settings to global for all documents.
Dispose | Causes the object to release immediately any resources it may be utilizing.
(Inherited from APIObject)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
SelectNewPrintDriver |  Select a new printer.
SubmitPrint() |  Print the views and sheets defined in the current local PrintManager settings.
SubmitPrint(View) |  Print a view with the current PrintManager settings.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
PrintManager Class
Autodesk.Revit.DB Namespace